# Конфигурация бота
BOT_TOKEN = "8207041880:AAEM1F0YaWF3jEKJ-GfRPPOosOBbpTnSY4M"  # Замените на ваш токен от @BotFather
ADMIN_ID = 8054980148  # Ваш ID

# Настройки анти-спама
MAX_CONSECUTIVE_IDENTICAL = 5
MAX_CONSECUTIVE_STICKERS = 5
SPAM_MUTE_DURATION = 3600
INSULT_MUTE_DURATION = 86400

# Текст для аппеляций
APPEAL_TEXT = "🆘Если вас замутило по ошибке: @rilyglrletukdetuluft (моментальный ответ 14:00 — 2:00)"

# Оскорбления
INSULT_PATTERNS = [
    r'[яy][аaa@][\s\W]*[тt][вb][оo0][ююu][\s\W]*[мm][аa@][тt][ь6b][\s\W]*[еeё][бb6][аa@][лl1]',
    r'[уy][\s\W]*[тt][еeё][бb6][яяy][\s\W]*[мm][аa@][тt][ь6b][\s\W]*[шsh][лl1][ююu][хxh]',
    r'[мm][аa@][тt][ь6b][\s\W]*[шsh][лl1][ююu][хxh]',
    r'[мm][аa@][тt][ь6b][\s\W]*[шsh][аa@][лl1][аa@][вb][аa@]',
    r'[мm][аa@][мm][уy][\s\W]*[еeё][бb6][аa@][лl1]',
]

APPEAL_TRIGGERS = [
    'он не спамил',
    'она не спамила',
    'зачем замутил',
    'размути',
    'ошибка',
    'почему мут'
]
